app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."created_at" >= $1 AND "orders"."created_at" < $2 ORDER BY "orders"."created_at" DESC LIMIT $3 OFFSET $4  [["created_at", "2022-04-19 00:00:00"], ["created_at", "2022-10-16 23:59:59.999999"], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."created_at" >= $1 AND "orders"."created_at" < $2  [["created_at", "2022-04-19 00:00:00"], ["created_at", "2022-10-16 23:59:59.999999"]]
---
  def index
    @orders = Order.filter(filtered_params).with_attached_images.page(@page).per(@per_page)